### numpy와 pandas 비교
- numpy에는 데이터 유형이 같은 것만 넣을 수 있다. -> 속도 느림
- pandas에는 데이터 유형이 달라도 넣을 수 있다. -> 속도 빠름

### 정형 데이터와 비정형 데이터
- 정형 데이터 ex) 표
- 비정형 데이터 ex) 비정형 텍스트, 비정형 이미지, 비정형 영상, 비정형 음성

### pandas 설치와 정형 데이터
- cmd 창에 pip install pandas 입력
- 정형 데이터를 handling 할 때 pandas를 사용한다.

### series와 Data Frame
- pandas : 서로 다른 유형의 데이터를 표로 관리한다.
- 표의 column이 1개 -> series
- 표의 column이 2개 -> Data Frame

In [4]:
# pandas ex_1
import pandas as pd

# 1. 기본문법
member = pd.Series(['홍길동','전우치','강감찬','스티브잡스'])
member

0      홍길동
1      전우치
2      강감찬
3    스티브잡스
dtype: object

In [5]:
# pandas ex_2
import pandas as pd

member=pd.Series(['홍길동','전우치','강감찬','스티브잡스'],
                 index = ['1번','2번','3번','4번'])
member

1번      홍길동
2번      전우치
3번      강감찬
4번    스티브잡스
dtype: object

In [6]:
# pandas ex_3
# 딕셔너리 형으로 생성하기

sal_1 = {'홍길동':100, '일지매' : 130, '전우치' : 120 }
sal_2 = pd.Series(sal_1)
sal_2

홍길동    100
일지매    130
전우치    120
dtype: int64

In [7]:
# pandas ex_4
import pandas as pd

member = pd.Series(['홍길동','전우치','강감찬','스티브잡스'],
                  index = ['1번','2번','3번','4번'])
member

1번      홍길동
2번      전우치
3번      강감찬
4번    스티브잡스
dtype: object

In [8]:
member['1번']

'홍길동'

In [9]:
member[ ['1번','3번'] ]

1번    홍길동
3번    강감찬
dtype: object

In [10]:
# pandas ex_5
sal_1 = {'일지매' : 130, '전우치' : 120, '홍길동' : 100}
sal_2 = pd.Series(sal_1)
sal_2

일지매    130
전우치    120
홍길동    100
dtype: int64

In [11]:
sal_3 = {'홍길동' : 10, '전우치' : 12, '강감찬' : 20}
sal_4 = pd.Series(sal_3)
sal_4

홍길동    10
전우치    12
강감찬    20
dtype: int64

In [13]:
print(sal_2 + sal_4) # 데이터 개수, 데이터 유형이 동일한 것끼리 연산

강감찬      NaN
일지매      NaN
전우치    132.0
홍길동    110.0
dtype: float64

In [14]:
# pandas ex_6
# 딕셔너리와 리스트를 활용하여 Data Frame 생성하기

member3 = {'번호' : ['1번','2번','3번'] ,
           '이름' : ['홍길동','전우치','강감찬'] ,
           '생년' : [1975, 1980, 1992] }
member4 = pd.DataFrame(member3)
member4

   번호   이름    생년
0  1번  홍길동  1975
1  2번  전우치  1980
2  3번  강감찬  1992

In [15]:
# pandas ex_7
# 딕셔너리와 리스트를 활용하여 Data Frame 생성하기 - 컬럼 이름 순서 지정하기

member3 = {'번호' : ['1번','2번','3번'],
           '이름' : ['홍길동','전우치','강감찬'],
           '생년' : [1975, 1980, 1992] }
member5 = pd.DataFrame(member3, columns=['번호', '생년', '이름'])
member5

   번호    생년   이름
0  1번  1975  홍길동
1  2번  1980  전우치
2  3번  1992  강감찬

In [17]:
# ★매우 중요(웹 크롤러 만들 때 사용)
# pandas ex_7_2
no = ['1번','2번','3번']
name = ['홍길동','전우치','강감찬']
birth = [1975,1982,1980]

member6 = pd.DataFrame()
member6['번호'] = no
member6['이름'] = name
member6['생년'] = birth
member6

   번호   이름    생년
0  1번  홍길동  1975
1  2번  전우치  1982
2  3번  강감찬  1980

In [19]:
member6.sort_values(['생년'], ascending=[False])
# ascending=[True] -> 오름차순
# ascending=[False] -> 내림차순

   번호   이름    생년
1  2번  전우치  1982
2  3번  강감찬  1980
0  1번  홍길동  1975

In [20]:
import pandas as pd

data1 = pd.read_excel('c:\\py_temp2\\부품구입대장2.xls')
data1

         신청날짜 사업장          품목  수량       단가        금액
0  2019-08-23  석수       ANGLE  21    32000    672000
1  2019-09-09  석수          백관  44    56000   2464000
2  2019-06-18  석수         절연판  40    45000   1800000
3  2019-03-13  석수  P/Z O-RING  11    38000    418000
4  2019-05-11  석수         알코올  38     8000    304000
5  2019-06-28  석수         실리콘  30   150000   4500000
6  2019-02-16  석수         소모품   4     2200      8800
7  2019-10-22  석수       MOTOR  14    30000    420000
8  2019-03-18  석수  PAPER BRSH  13    40000    520000
9  2019-07-17  석수        불화카리  23    83000   1909000
10 2019-07-23  석수         마크펜  33     3000     99000
11 2019-03-20  석수         NUT  20    15000    300000
12 2019-01-27  석수         윤활유  30  2000000  60000000
13 2019-07-11  석수         소모품  50     2200    110000
14 2019-05-16  석수        BITE  14    86000   1204000

In [21]:
# csv 파일 불러오기 - 인코딩 지정하기
import pandas as pd

data1 = pd.read_csv('c:\\py_temp2\\사원별판매현황_홍길동.csv',
                   names = ['이름','요일','실적'], encoding='cp949')
data1

    이름   요일   실적
0   이름   요일   실적
1  홍길동  월요일  100
2  홍길동  화요일   70
3  홍길동  수요일   80
4  홍길동  목요일   85
5  홍길동  금요일   65
6  홍길동  토요일   95
7  홍길동  일요일  120

In [22]:
# data frame 에서 원하는 데이터 조회하기
member5

   번호    생년   이름
0  1번  1975  홍길동
1  2번  1980  전우치
2  3번  1992  강감찬

In [23]:
member5['생년'] # 2개 이상의 컬럼일 경우 member5[ ['이름','생년'] ]

0    1975
1    1980
2    1992
Name: 생년, dtype: int64

In [24]:
member5.loc[0]

번호      1번
생년    1975
이름     홍길동
Name: 0, dtype: object

In [25]:
member5.loc[ member5['번호'] >= '2']

   번호    생년   이름
1  2번  1980  전우치
2  3번  1992  강감찬

In [26]:
member6 = {'번호' : [1,2,3,4,5] ,
           '이름' : ['홍길동', '전우치', '강감찬', '일지매', '을지문덕'],
           '매출' : [100,200,300,250,150]}
member7 = pd.DataFrame(member6 , columns=['번호','이름','매출'])
member7

   번호    이름   매출
0   1   홍길동  100
1   2   전우치  200
2   3   강감찬  300
3   4   일지매  250
4   5  을지문덕  150

In [27]:
# 매출이 100 이상 ~ 200 이하인 행만 출력하기
member7.loc[ (member7['매출'] >= 100) & (member7['매출'] <= 200)]

   번호    이름   매출
0   1   홍길동  100
1   2   전우치  200
4   5  을지문덕  150

In [28]:
# 매출이 100 이상 ~ 200 이하인 행의 이름 컬럼과 매출 컬럼만 출력하기
member7.loc[ (member7['매출'] >= 100) & (member7['매출'] <= 200),['이름','매출']]

     이름   매출
0   홍길동  100
1   전우치  200
4  을지문덕  150

In [29]:
# 매출이 150 이하 이거나 또는 300 이상인 행의 이름 컬럼과 매출 컬럼만 출력하기
member7.loc[ (member7['매출'] <= 150) | (member7['매출'] >= 300),['이름','매출'] ]

     이름   매출
0   홍길동  100
2   강감찬  300
4  을지문덕  150

In [31]:
# 새로운 열 추가하기
member8 = pd.DataFrame( member5 ,columns=['번호','이름','생년','지역'])
member8

   번호   이름    생년  지역
0  1번  홍길동  1975 NaN
1  2번  전우치  1980 NaN
2  3번  강감찬  1992 NaN

In [32]:
member8['지역'] = ['서울','대전','강원']
member8

   번호   이름    생년  지역
0  1번  홍길동  1975  서울
1  2번  전우치  1980  대전
2  3번  강감찬  1992  강원

In [33]:
# 새로운 행 추가하기
member8.loc[3] = ['4번','서진수',1975,'경기']
member8

   번호   이름    생년  지역
0  1번  홍길동  1975  서울
1  2번  전우치  1980  대전
2  3번  강감찬  1992  강원
3  4번  서진수  1975  경기

In [34]:
# 행과 열 삭제하기
member8.drop([0])

   번호   이름    생년  지역
1  2번  전우치  1980  대전
2  3번  강감찬  1992  강원
3  4번  서진수  1975  경기

In [35]:
# 특정 조건의 행 삭제하기
member8.drop( member8[ member8.생년 >= 1980].index)

   번호   이름    생년  지역
0  1번  홍길동  1975  서울
3  4번  서진수  1975  경기

In [36]:
# 2개 이상의 특정 조건을 지정하여 특정 행 삭제하기
member8.drop( member8[ (member8.생년 >= 1980) | (member8.지역=='서울')].index)

   번호   이름    생년  지역
3  4번  서진수  1975  경기

In [38]:
# merge 실습용 데이터 생성 1
df_1 = {'학번' : ['1001','1002','1003'] ,
        '이름' : ['홍길동','일지매','전우치'] ,
        '키' : [180, 175, 168] }
stu_1 = pd.DataFrame(df_1)
stu_1

     학번   이름    키
0  1001  홍길동  180
1  1002  일지매  175
2  1003  전우치  168

In [37]:
# merge 실습용 데이터 생성 2
df_2 = {'학번' : ['1001','1002','1004'] ,
        '이름' : ['홍길동','일지매','강감찬'] ,
        '몸무게' : [80, 75, 68] }
stu_2 = pd.DataFrame(df_2)
stu_2

     학번   이름  몸무게
0  1001  홍길동   80
1  1002  일지매   75
2  1004  강감찬   68

- left_on='이름', right_on='이름' 은 merge 하는 기준이다.
- 이름이 똑같은 것끼리 merge 하도록 한다.

In [39]:
# 기본값으로 merge - inner join 방식
pd.merge(stu_1, stu_2, left_on='이름', right_on='이름')

   학번_x   이름    키  학번_y  몸무게
0  1001  홍길동  180  1001   80
1  1002  일지매  175  1002   75

- how='left' 왼쪽 테이블을 기준으로 왼쪽에 있는 데이터는 다 뽑아!
- how='right' 오른쪽 테이블을 기준으로 오른쪽에 있는 데이터는 다 뽑아!
- how='outer' 오른쪽에 있고 왼쪽에 없는 것과 왼쪽에 있고 오른쪽에 없는 것을 모두 뽑아!

In [40]:
# Merge 예제 - merge 할 기준을 지정하기
pd.merge(stu_1 , stu_2 , how='left',left_on='이름', right_on='이름')

   학번_x   이름    키  학번_y   몸무게
0  1001  홍길동  180  1001  80.0
1  1002  일지매  175  1002  75.0
2  1003  전우치  168   NaN   NaN

In [41]:
pd.merge(stu_1 , stu_2 , how='right', left_on='이름', right_on='이름')

   학번_x   이름      키  학번_y  몸무게
0  1001  홍길동  180.0  1001   80
1  1002  일지매  175.0  1002   75
2   NaN  강감찬    NaN  1004   68

In [42]:
pd.merge(stu_1 , stu_2 , how='outer', left_on='이름', right_on='이름')

   학번_x   이름      키  학번_y   몸무게
0  1001  홍길동  180.0  1001  80.0
1  1002  일지매  175.0  1002  75.0
2  1003  전우치  168.0   NaN   NaN
3   NaN  강감찬    NaN  1004  68.0

- axis=0 위아래로 merge
- axis=1 좌우로 merge

In [43]:
pd.concat([stu_1, stu_2], axis=0)

     학번   이름      키   몸무게
0  1001  홍길동  180.0   NaN
1  1002  일지매  175.0   NaN
2  1003  전우치  168.0   NaN
0  1001  홍길동    NaN  80.0
1  1002  일지매    NaN  75.0
2  1004  강감찬    NaN  68.0

In [44]:
pd.concat([stu_1, stu_2], axis=1)

     학번   이름    키    학번   이름  몸무게
0  1001  홍길동  180  1001  홍길동   80
1  1002  일지매  175  1002  일지매   75
2  1003  전우치  168  1004  강감찬   68